<template>
    <v-app>
        <navbar/>
        <v-main class="mainArea">
            <center>
                <div class="default_contianer mt-5" >
                    <v-row>
                        <v-col cols="12" lg="8">
                            <div class="titleArea">
                                <img src="../assets/picture/placeholder.webp" width="100%" alt="">
                                <h3>چگونه به عنوان یک برنامه نویس درآمد بیشتری داشته باشیم؟</h3>
                                <p>
                                    <b>علی امیری</b>
                                    در
                                    <b>برنامه نویسی وب </b>
                                </p>
                            </div>
                            <div class="contentArea">
                                <p>
                                    آیا شما هم علاقه مند به افزایش درآمد خود به عنوان یک برنامه نویس هستید؟ در این مطلب
                                    درباره استراتژی های افزایش درآمد برای برنامه نویسان صحبت می کنیم.

                                    برنامه نویس بودن می تواند برای هر کسی فوق العاده باشد. در این شغل نه تنها شما اکثر
                                    مواقع سرگرم هستید بلکه فرصت های شغلی زیادی برای شما وجود دارد که اکثر آنها نیز دارای
                                    حقوق و درآمد بالایی هستند. با این حال برخی از مواقع ممکن است شما نیاز به درآمد
                                    بیشتری داشته باشید. ممکن است شما در دوران تحصیل خود باشید و به جای این که در یک شرکت
                                    استخدام شوید علاقه مند هستید تا به عنوان یک برنامه نویس برای خودتان کار کنید یا این
                                    که ممکن است یک فرزند داشته باشید و علاقه مند باشید تا زمان بیشتری را با او بگذرانید
                                    و به همین علت نمی توانید در شرکت ها کار کنید و باید برای خودتان کار کنید. شما به
                                    عنوان یک برنامه نویس هرآنچه که برای افزایش درآمد نیاز دارید را در اختیار دارید.
                                    مغزتان، لپ تاپ و اینترنت تنها چیزهایی هستند که شما به آنها نیاز دارید. برای افزایش
                                    درآمد برنامه نویسی می توانید استراتژی هایی که در ادامه بیان می کنیم را بررسی کنید تا
                                    متوجه شوید که کدام یک می توانند برای شما گزینه بهتری باشند.

                                    به عنوان یک برنامه نویس، فریلنسری را آغاز کنید
                                    فریلنسرینگ می تواند برای شما بسیار مفید باشد. شما می توانید بدون داشتن یک رئیس برای
                                    خودتان کار کنید، تعداد زیادی پروژه وجود دارد که می توانید هر یک از آنها را انتخاب
                                    کنید، افرادی که تخصص زیادی دارند معمولا درآمد زیادی نیز از این طریق به دست می آورند،
                                    شما می توانید تعطیلات زیادی در طول سال داشته باشید و بسیاری از مزایای دیگر که باعث
                                    می شود تا فریلنسینگ یک شغل بسیار مفید باشد.

                                    با این حال شما برای پیدا کردن مشتری و پروژه جدید باید نظم و انضباط زیادی داشته
                                    باشید. یکی از بزرگ ترین مزایای این شغل این است که شما می توانید در کنار شغل اصلی خود
                                    در زمان های آزادی که دارید یا در تعطیلات پروژه انجام دهید.


                                    کار روی پروفایل لینکدین
                                    یک استراتژی بهتر برای شروع کار به عنوان یک فریلنسر این است که روی پروفایل لینکدین
                                    خود کار کنید. سعی کنید با استخدام کنندگان و مشتریان قبلی خود ارتباط بگیرید، در
                                    کنفرانس ها و جلسات مختلف شرکت کنید و به دنبال پلتفرم هایی باشید که امکان کار کردن از
                                    راه دور را برای شما فراهم می کنند.


                                    در مسابقات کدنویسی شرکت کنید
                                    بله این موضوع کاملا واقعی است. پلتفرم های اختصاصی وجود دارند که مسابقات برنامه نویسی
                                    را با جایزه های واقعی برگزار می کنند. یکی از بزرگترین این پلتفرم ها پلتفرم Topcoder
                                    است که بیش از یک میلیون عضو دارد و هر ساله مسابقات زیادی را در این زمینه برگزار می
                                    کند. این پلتفرم دارای سه محور اصلی طراحی، توسعه و علم داده است.

                                    شما می توانید روی پروژه های واقعی کار کنید که توسط بیش از 2000 نفر دیگر نیز انجام می
                                    شوند یا این که می توانید در مسابقات تک نفره شرکت کنید و با حریفان خود رقابت کنید.
                                    این کار به شما تضمین می دهد که منحنی یادگیری خود را بهبود دهید و خیلی سریع مهارت های
                                    خود را بهبود دهید.

                                    اگر به چالش های برنامه نویسی علاقه مند هستید این مسابقات می توانند برای شما بسیار
                                    جذاب و هیجان انگیز باشند. با این حال نباید فراموش کنید که این مسابقات دارای رقابت
                                    شدیدی هستند و شما نمی توانید انتظار درآمد ثابتی از آنها داشته باشید.
                                </p>
                            </div>
                        </v-col>
                        <v-col cols="12" lg="4">
                            <h4 class="title_trend">محبوب ترین ها </h4>
                            <trends class="mt-5"/>
                        </v-col>
                    </v-row>
                </div>
            </center>
        </v-main>

    </v-app>
</template>

<script>
    import Navbar from "../components/main/navbar";
    import Trends from "../components/main/tends";

    export default {
        name: "post",
        components: {Trends, Navbar},
        props: {
            id: Number,
        }
    }
</script>

<style scoped>
    .titleArea {
        font-family: main;
    }

    .contentArea {
        font-family: main;
        line-height: 45px;
        text-align: justify;
        /*font-size: ;*/
    }

    .titleArea img {
        border-radius: 10px;
    }

    .titleArea h3 {
        text-align: right;
        margin: 20px 0px 10px 0px;
    }

    .titleArea p {
        text-align: right;
        font-size: 12px;
    }

</style>
